

Verified **fixed** on terraform-provider-harvester `master` with Harvester `v1.8.0-rc4`. Close this issue.


### Prerequisite setup

<details><summary>Prepare terraform-provider-environment </summary>

1. Clone the latest https://github.com/harvester/terraform-provider-harvester.git
2. cd terraform-provider-harvester
3. Remove the terraform cache
  ```
  rm -rf ~/.terraform.d/plugins/registry.terraform.io/harvester
  ```
4. Build the iso file
  ```
  CGO_ENABLED=0 go build -mod=vendor -o bin/terraform-provider-harvester .
  ```
  ```
      (sync the vendor directory: `go mod vendor`)
  ```
5. Create the system path 
  ```
  mkdir -p ~/.terraform.d/plugins/registry.terraform.io/harvester/harvester/0.0.0-dev/linux_amd64
  ```
6. Copy the terraform bin to the system path
  ```
  cp bin/terraform-provider-harvester ~/.terraform.d/plugins/registry.terraform.io/harvester/harvester/0.0.0-dev/linux_amd64/terraform-provider-harvester_v0.0.0-dev
  ```
7. ssh to Harvester and get kubeconfig content in `/etc/rancher/rke2/rke2.yaml` 
8. change owner to rancher:rancher of rke2.yaml
9. Copy the content to host machine ${pwd}/config 
10. Update the `server:` to harvester management ip address
11. Remove previous state files
  ```
  rm -rf .terraform .terraform.lock.hcl terraform.tfstate terraform.tfstate.backup
  ```
12. Prepare the providers.tf file

  ```
  terraform {
    required_providers {
      harvester = {
        source = "harvester/harvester"
        version = "0.0.0-dev"
      }
    }
  }
  
  provider "harvester" {
    kubeconfig = "./config"
  }
  ```

13. Prepare the resource file main.tf

  ```
  resource "harvester_image" "opensuse_155" {
    name      = "opensuse-15.5"
    namespace = "default"
  
    display_name = "openSUSE-Leap-15.5"
    source_type  = "download"
    url          = "http://10.115.1.6/iso/opensuse/openSUSE-Leap-15.5.x86_64-NoCloud.qcow2"
  
    storage_class_name = "harvester-longhorn"
  }
  ```
14. Initialize terraform `terraform init`
15. Apply the resource `terraform apply`


 </details>


<details><summary> Harvester environment setup </summary>

1. Upload an image
2. Create a vm named `vm1`


 </details>

<details><summary> Prepare the resource file </summary>

  ```
  resource "harvester_schedule_backup" "daily" {
    name      = "daily-backup"
    namespace = "default"
    vm_name   = "default/vm1"
    schedule  = "0 2 * * *"  # Daily at 2 AM UTC
    retain    = 7            # Keep last 7 backups
    enabled   = true
  }
  
  ```

 </details>


### Result
<details><summary>$\color{green}{\textsf{PASS}}$ Can provision the virtual machine schedule $~~$</summary>

  ```
  Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
    + create
  
  Terraform will perform the following actions:
  
    # harvester_schedule_backup.daily will be created
    + resource "harvester_schedule_backup" "daily" {
        + enabled   = true
        + id        = (known after apply)
        + message   = (known after apply)
        + name      = "daily-backup"
        + namespace = "default"
        + retain    = 7
        + schedule  = "0 2 * * *"
        + state     = (known after apply)
        + vm_name   = "vm1"
      }
  
  Plan: 1 to add, 0 to change, 0 to destroy.
  
  Do you want to perform these actions?
    Terraform will perform the actions described above.
    Only 'yes' will be accepted to approve.
  
    Enter a value: yes
  
  harvester_schedule_backup.daily: Creating...
  harvester_schedule_backup.daily: Creation complete after 1s [id=default/vm1/daily-backup]
  
  Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
  ```

  <img width="1596" height="784" alt="Image" src="https://github.com/user-attachments/assets/d21b3d47-e0f9-48b0-81d2-3859c5729e5c" />

 </details>

<details><summary>$\color{green}{\textsf{PASS}}$ Can update the retain number of the schedule $~~$</summary>

  ```
  Terraform will perform the following actions:
  
    # harvester_schedule_backup.daily will be updated in-place
    ~ resource "harvester_schedule_backup" "daily" {
          id        = "default/vm1/daily-backup"
          name      = "daily-backup"
        ~ retain    = 7 -> 8
        ~ vm_name   = "default/vm1" -> "vm1"
          # (3 unchanged attributes hidden)
      }
  
  Plan: 0 to add, 1 to change, 0 to destroy.
  
  Do you want to perform these actions?
    Terraform will perform the actions described above.
    Only 'yes' will be accepted to approve.
  
    Enter a value: yes
  
  harvester_schedule_backup.daily: Modifying... [id=default/vm1/daily-backup]
  harvester_schedule_backup.daily: Modifications complete after 1s [id=default/vm1/daily-backup]
  
  Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
  ```

  <img width="1598" height="784" alt="Image" src="https://github.com/user-attachments/assets/977f1b6d-1b4d-44ae-af37-cb9f235d3cfe" />


 </details>


<details><summary>$\color{green}{\textsf{PASS}}$ Can update the schedule of the schedule $~~$</summary>

  ```
  Terraform will perform the following actions:
  
    # harvester_schedule_backup.daily will be updated in-place
    ~ resource "harvester_schedule_backup" "daily" {
          id        = "default/vm1/daily-backup"
          name      = "daily-backup"
        ~ schedule  = "0 2 * * *" -> "0 6 * * *"
        ~ vm_name   = "default/vm1" -> "vm1"
          # (3 unchanged attributes hidden)
      }
  
  Plan: 0 to add, 1 to change, 0 to destroy.
  
  Do you want to perform these actions?
    Terraform will perform the actions described above.
    Only 'yes' will be accepted to approve.
  
    Enter a value: yes
  
  harvester_schedule_backup.daily: Modifying... [id=default/vm1/daily-backup]
  harvester_schedule_backup.daily: Modifications complete after 1s [id=default/vm1/daily-backup]
  
  Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
  ```
  
  <img width="1591" height="781" alt="Image" src="https://github.com/user-attachments/assets/f8ad6b78-f388-4d82-a868-bedd5964a1f5" />
  

 </details>


<details><summary>$\color{green}{\textsf{PASS}}$ Can disable the schedule $~~$</summary>

  ```
  Terraform will perform the following actions:
  
    # harvester_schedule_backup.daily will be updated in-place
    ~ resource "harvester_schedule_backup" "daily" {
        ~ enabled   = true -> false
          id        = "default/vm1/daily-backup"
          name      = "daily-backup"
        ~ vm_name   = "default/vm1" -> "vm1"
          # (3 unchanged attributes hidden)
      }
  
  Plan: 0 to add, 1 to change, 0 to destroy.
  
  Do you want to perform these actions?
    Terraform will perform the actions described above.
    Only 'yes' will be accepted to approve.
  
    Enter a value: yes
  
  harvester_schedule_backup.daily: Modifying... [id=default/vm1/daily-backup]
  harvester_schedule_backup.daily: Modifications complete after 2s [id=default/vm1/daily-backup]
  
  Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
  ```
  
  <img width="1600" height="789" alt="Image" src="https://github.com/user-attachments/assets/2169c0a8-1cbc-4d5d-8910-c1258b687457" />

 </details>



### Test Information
* Test Environment: Three nodes kvm machines
* Harvester version: v1.8.0-rc4
* Terraform-provider-harvester: master (26/03/29)

### Verify Steps
<details><summary>Test steps </summary>

  1. Refer to Prerequisite setup section

</details>










